## 210968002 
## Sagar Kumar
## Week 2
## Exercise 2 - Introduction to Pandas

In [12]:
import pandas as pd
import random as r

 ### Q1
 #### Create a data frame with details of 10 students and columns as Roll Number, Name, Gender, Marks1, Marks2, Marks3.

In [13]:
from random import randrange


random = lambda:  [r.randint(0, 100) for i in range(10)]

data = {
    "Roll Number": [*range(1, 11)],
    "Name": ["Sagar", "Suzen", "Sourabh", "Srinivas", "Kriti", "Sanath", "Dhruv", "Lance", "John", "Riya"],
    "Gender": ["M", "M", "M", "M", "F", "M", "M", "M", "M", "F"],
    "Marks1": random(),
    "Marks2": random(), 
    "Marks3": random(),
}

In [14]:
df = pd.DataFrame(data)
df

   Roll Number      Name Gender  Marks1  Marks2  Marks3
0            1     Sagar      M      69      10      75
1            2     Suzen      M       3      32      48
2            3   Sourabh      M      79      51      46
3            4  Srinivas      M      53      26      92
4            5     Kriti      F      39      22      64
5            6    Sanath      M      29      81      82
6            7     Dhruv      M      88      35      59
7            8     Lance      M      37      77      63
8            9      John      M       8      18      98
9           10      Riya      F       1      37      33

### Q2
#### Create a new column with total marks

In [15]:
total = df["Marks1"] + df["Marks2"] + df["Marks3"]
df["Total"] = list(total)
df

   Roll Number      Name Gender  Marks1  Marks2  Marks3  Total
0            1     Sagar      M      69      10      75    154
1            2     Suzen      M       3      32      48     83
2            3   Sourabh      M      79      51      46    176
3            4  Srinivas      M      53      26      92    171
4            5     Kriti      F      39      22      64    125
5            6    Sanath      M      29      81      82    192
6            7     Dhruv      M      88      35      59    182
7            8     Lance      M      37      77      63    177
8            9      John      M       8      18      98    124
9           10      Riya      F       1      37      33     71

### Q3
#### Find the lowest marks in Marks1

In [16]:
lowest_marks = min(df["Marks1"])
lowest_marks

1

### Q4
#### Find the Highest marks in Marks2

In [17]:
highest_marks = max(df["Marks2"])
highest_marks

81

### Q5
#### Find the average marks in Marks3

In [18]:
marks_three = df["Marks3"]
avg_marks = sum(marks_three) / len(marks_three)
avg_marks

66.0

### Q6
#### Find student name with highest average

In [36]:
list(df[df["Total"] == df["Total"].max()].get("Name"))[0]

'Sanath'

### Q7
#### Find how many students failed in Marks2 (<40)

In [20]:
len(df[df["Marks2"] < 40])

7